package main

import "main.go/ForCheck"

func main() {
	ForCheck.CalcCoordinates()
}

func IDontKnow(num int) int {

}

func multiplyNumber() {

}

func addNumber() {}

//Задание 3. Именованные возвращаемые значения
//Что нужно сделать
//Напишите программу, которая на вход получает число, затем с помощью двух функций преобразует его. Первая умножает, а вторая прибавляет число, используя именованные возвращаемые значения.
//
//
//
//Задание 4. Область видимости переменных
//Что нужно сделать
//Напишите программу, в которой будет три функции, попарно использующие разные глобальные переменные. Функции должны прибавлять к поданному на вход числу глобальную переменную и возвращать результат.
//Затем вызовите по очереди три функции, передавая результат из одной в другую.
